emacs.d/emacs.org
# -*- mode: org -*-
#+OPTIONS: toc:0 num:nil
# #######################################################################
#+TITLE:     emacs configuration file
#+SUBTITLE:  ORGfied configuration for Emacs
#+AUTHOR:    gugutz
# #+EMAIL:     gustavo.pb1984@aluno.ifsc.edu.br
#+DESCRIPTION: This file is compiled to init.el automatically on every save
# #######################################################################

* Recompile init.el everytime emacs.org is changed and saved
  
   Moved this to beggining of the file to avoid it not being parsed when theres an error in the middle of the file
It was being recompiled without this function so i had to manually re-copy first-init.el to make it compile first time again and again


#+BEGIN_SRC emacs-lisp :tangle init.el
(defun /util/tangle-init ()
  (interactive)
  "If the current buffer is init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "emacs.org")))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-save-hook #'/util/tangle-init)
#+END_SRC


* Package Repositories

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'package)
  ;; add melpa stable emacs package repository
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t) ; Org-mode's repository
#+END_SRC

** initialize packages
#+BEGIN_SRC emacs-lisp :tangle init.el
  (package-initialize)
#+END_SRC

moved this part to beggining of the file because if the
custom-safe-themes variable is not set before smart-mode-line (sml) activates
emacs asks 2 annoying confirmations on every startup before actually starting

#+BEGIN_SRC emacs-lisp :tangle init.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   (quote
    ("84d2f9eeb3f82d619ca4bfffe5f157282f4779732f48a5ac1484d94d5ff5b279" "57f95012730e3a03ebddb7f2925861ade87f53d5bbb255398357731a7b1ac0e0" "3c83b3676d796422704082049fc38b6966bcad960f896669dfc21a7a37a748fa" default)))
 '(fci-rule-color "#3E4451")
 '(package-selected-packages
   (quote
    (pdf-tools ox-pandoc ox-reveal org-preview-html latex-preview-pane smart-mode-line-powerline-theme base16-theme gruvbox-theme darktooth-theme rainbow-mode smartscan restclient editorconfig prettier-js pandoc rjsx-mode js2-refactor web-mode evil-org multiple-cursors flycheck smart-mode-line ## evil-leader evil-commentary evil-surround htmlize magit neotree evil json-mode web-serverx org))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+END_SRC


* Bindings


These macros are to help me remap keys.

#+BEGIN_SRC emacs-lisp :tangle init.el
(defmacro /bindings/define-prefix-keys (keymap prefix &rest body)
  (declare (indent defun))
  `(progn
     ,@(cl-loop for binding in body
                collect
                `(let ((seq ,(car binding))
                       (func ,(cadr binding))
                       (desc ,(caddr binding)))
                   (define-key ,keymap (kbd seq) func)
                   (when desc
                     (which-key-add-key-based-replacements
                       (if ,prefix
                           (concat ,prefix " " seq)
                         seq)
                       desc))))))

(defmacro /bindings/define-keys (keymap &rest body)
  (declare (indent defun))
  `(/bindings/define-prefix-keys ,keymap nil ,@body))

(defmacro /bindings/define-key (keymap sequence binding &optional description)
  (declare (indent defun))
  `(/bindings/define-prefix-keys ,keymap nil
     (,sequence ,binding ,description)))
#+END_SRC


* Environment setup

** Allow access from emacsclient
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'server)
  (unless (or (daemonp) (server-running-p))
    (server-start))
#+END_SRC


** Prevent emacs to create lockfiles (.#files#). 
   
PS: this also stops preventing editing colisions, so watch out

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq create-lockfiles nil)
#+END_SRC


** Always follow symbolic links to edit the 'actual' file it points to
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq vc-follow-symlinks t)
#+END_SRC


** Enable mouse support in terminal mode
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (eq window-system nil)
  (xterm-mouse-mode 1))
#+END_SRC


** Save all tempfiles in $TMPDIR/emacs$UID/
   
#+BEGIN_SRC emacs-lisp :tangle init.el
    (defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
    (setq backup-directory-alist
        `((".*" . ,emacs-tmp-dir)))
    (setq auto-save-file-name-transforms
        `((".*" ,emacs-tmp-dir t)))
    (setq auto-save-list-file-prefix
        emacs-tmp-dir)
#+END_SRC
        
      
** Disable the annoying Emacs bell ring (beep)

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq ring-bell-function 'ignore)
#+END_SRC


* After 

with-eval-after-load is a function that lets you defer execution of code until after a feature has been loaded.
It is very useful to only load some packages when they’re, and because of that it is extensively used in this setup. 
So of course there is a macro to make it simpler. It can also run code if a package has been installed by using “pkgname-autoloads” or only if multiple packages have been loaded.
This also avoids loading config for packages that haven’t been loaded yet, resulting in void variables of function definitions. 
This was take from milkypostman (along with some other things).

#+BEGIN_SRC emacs-lisp :tangle init.el
;; examples
;; after [evil magit] (
  ;; execute after evil and magit have been loaded
;  )

;; macro definiton
(defmacro after (feature &rest body)
  "Executes BODY after FEATURE has been loaded.

FEATURE may be any one of:
    'evil            => (with-eval-after-load 'evil BODY)
    \"evil-autoloads\" => (with-eval-after-load \"evil-autolaods\" BODY)
    [evil cider]     => (with-eval-after-load 'evil
                          (with-eval-after-load 'cider
                            BODY))
"
  (declare (indent 1))
  (cond
   ((vectorp feature)
    (let ((prog (macroexp-progn body)))
      (cl-loop for f across feature
               do
               (progn
                 (setq prog (append `(',f) `(,prog)))
                 (setq prog (append '(with-eval-after-load) prog))))
      prog))
   (t
    `(with-eval-after-load ,feature ,@body))))
#+END_SRC


* Packages
   
** Add the folder 'config' to emacs load-path
so i can require stuff from there

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'load-path (expand-file-name "config" user-emacs-directory))
#+END_SRC



** Require needed packages
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;(after 'evil
  ;  (require 'evil.tau))

    (require 'evil.tau)
    
  ;(after 'org
  ;  (require 'org.tau))

    (require 'org.tau)

#+END_SRC


* Evil

: All Evil settings are meant to be isolates in a separate file evil.tau.

** Require Evil related packages

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (require 'evil)
  (evil-mode 1)
#+END_SRC



** Don't wait for any other keys after escape is pressed.
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
; (setq evil-esc-delay 0)
#+END_SRC


** Make Evil look a bit more like (n) vim  (??)
: not sure what all these options do yet

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (setq evil-search-module 'isearch-regexp)
  (setq evil-magic 'very-magic)
  (setq evil-shift-width (symbol-value 'tab-width))
  (setq evil-regexp-search t)
  (setq evil-search-wrap t)
  ;; (setq evil-want-C-i-jump t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-fine-undo nil)
  (setq evil-want-integration nil)
  ;; (setq evil-want-abbrev-on-insert-exit nil)
  (setq evil-want-abbrev-expand-on-insert-exit nil)
  ;; move evil tag to beginning of modeline
  (setq evil-mode-line-format '(before . mode-line-front-space))
#+END_SRC




** Simulate Vim behaviour and some bindings

   
*** make esc quit or cancel everything in Emacs
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (define-key evil-normal-state-map [escape] 'keyboard-quit)
  (define-key evil-visual-state-map [escape] 'keyboard-quit)
  (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
#+END_SRC




** Cursor is alway black because of evil.

: Here is the workaround
: (@see https://bitbucket.org/lyro/evil/issue/342/evil-default-cursor-setting-should-default)
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (setq evil-default-cursor t)
#+END_SRC



