emacs.d/emacs.org
*** recover native emacs commands that are overriden by evil
: this gives priority to native emacs behaviour rathen than Vim's

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (define-key evil-normal-state-map (kbd "SPC") 'ace-jump-mode)
  (define-key evil-insert-state-map (kbd "C-e") 'move-end-of-line)
  (define-key evil-insert-state-map (kbd "C-k") 'kill-line)
  (define-key evil-normal-state-map (kbd "C-k") 'kill-line)
  (define-key evil-insert-state-map (kbd "C-w") 'kill-region)
  (define-key evil-normal-state-map (kbd "C-w") 'kill-region)
  (define-key evil-visual-state-map (kbd "C-w") 'kill-region)
  (define-key evil-visual-state-map (kbd "C-e") 'move-end-of-line)
  (define-key evil-normal-state-map (kbd "C-e") 'move-end-of-line)
  (define-key evil-normal-state-map (kbd "C-y") 'yank)
  (define-key evil-insert-state-map (kbd "C-y") 'yank)
  (define-key evil-visual-state-map (kbd "SPC") 'ace-jump-mode)
  (define-key evil-normal-state-map "\C-e" 'evil-end-of-line)
  (define-key evil-insert-state-map "\C-e" 'end-of-line)
  (define-key evil-visual-state-map "\C-e" 'evil-end-of-line)
  (define-key evil-motion-state-map "\C-e" 'evil-end-of-line)
  (define-key evil-normal-state-map "\C-f" 'evil-forward-char)
  (define-key evil-insert-state-map "\C-f" 'evil-forward-char)
  (define-key evil-insert-state-map "\C-f" 'evil-forward-char)
  (define-key evil-normal-state-map "\C-b" 'evil-backward-char)
  (define-key evil-insert-state-map "\C-b" 'evil-backward-char)
  (define-key evil-visual-state-map "\C-b" 'evil-backward-char)
  (define-key evil-normal-state-map "\C-d" 'evil-delete-char)
  (define-key evil-insert-state-map "\C-d" 'evil-delete-char)
  (define-key evil-visual-state-map "\C-d" 'evil-delete-char)
  (define-key evil-normal-state-map "\C-n" 'evil-next-line)
  (define-key evil-insert-state-map "\C-n" 'evil-next-line)
  (define-key evil-visual-state-map "\C-n" 'evil-next-line)
  (define-key evil-normal-state-map "\C-p" 'evil-previous-line)
  (define-key evil-insert-state-map "\C-p" 'evil-previous-line)
  (define-key evil-visual-state-map "\C-p" 'evil-previous-line)
  (define-key evil-normal-state-map "\C-w" 'evil-delete)
  (define-key evil-insert-state-map "\C-w" 'evil-delete)
  (define-key evil-visual-state-map "\C-w" 'evil-delete)
  (define-key evil-normal-state-map "\C-y" 'yank)
  (define-key evil-insert-state-map "\C-y" 'yank)
  (define-key evil-visual-state-map "\C-y" 'yank)
  (define-key evil-normal-state-map "\C-k" 'kill-line)
  (define-key evil-insert-state-map "\C-k" 'kill-line)
  (define-key evil-visual-state-map "\C-k" 'kill-line)
  (define-key evil-normal-state-map "Q" 'call-last-kbd-macro)
  (define-key evil-visual-state-map "Q" 'call-last-kbd-macro)
  (define-key evil-insert-state-map "\C-e" 'end-of-line)
  (define-key evil-insert-state-map "\C-r" 'search-backward)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  ;; (define-key evil-window-map "\C-h" 'evil-window-left)
  ;; (define-key evil-window-map "\C-j" 'evil-window-down)
  ;; (define-key evil-window-map "\C-k" 'evil-window-up)
  ;; (define-key evil-window-map "\C-l" 'evil-window-right)
#+END_SRC



*** change cursor color according to mode
    
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (setq evil-emacs-state-cursor '("#ff0000" box))
  (setq evil-motion-state-cursor '("#FFFFFF" box))
  (setq evil-normal-state-cursor '("#00ff00" box))
  (setq evil-visual-state-cursor '("#abcdef" box))
  (setq evil-insert-state-cursor '("#e2f00f" bar))
  (setq evil-replace-state-cursor '("red" hbar))
  (setq evil-operator-state-cursor '("red" hollow))
#+END_SRC

*** multiple cursors

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  ;; step 1, select thing in visual-mode (OPTIONAL)
  ;; step 2, `mc/mark-all-like-dwim' or `mc/mark-all-like-this-in-defun'
  ;; step 3, `ace-mc-add-multiple-cursors' to remove cursor, press RET to confirm
  ;; step 4, press s or S to start replace
  ;; step 5, press C-g to quit multiple-cursors
  (define-key evil-visual-state-map (kbd "mn") 'mc/mark-next-like-this)
  (define-key evil-visual-state-map (kbd "ma") 'mc/mark-all-like-this-dwim)
  (define-key evil-visual-state-map (kbd "md") 'mc/mark-all-like-this-in-defun)
  (define-key evil-visual-state-map (kbd "mm") 'ace-mc-add-multiple-cursors)
  (define-key evil-visual-state-map (kbd "ms") 'ace-mc-add-single-cursor)
#+END_SRC

*** imitate vim multiple selection behavior with multiple-cursors package
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  ;; (define-key evil-normal-state-map (kbd "C-n") 'mc/mark-next-like-this)
  ;; (define-key evil-normal-state-map (kbd "M-N") 'mc/mark-previous-like-this)
#+END_SRC


*** evil-leader

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'evil-leader)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (global-evil-leader-mode)
  (evil-leader/set-leader ",")
  (evil-leader/set-key
    "e" 'find-file
    "q" 'evil-quit
    "w" 'save-buffer
    "k" 'kill-buffer
    "b" 'switch-to-buffer
    "-" 'split-windowellow
    "|" 'split-window-right)
#+END_SRC

*** Evil Surround
: @see https://github.com/timcharper/evil-surround for tutorial

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (require 'evil-surround)
  (global-evil-surround-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(defun evil-surround-prog-mode-hook-setup ()
  "Documentation string, idk, put something here later."
  (push '(47 . ("/" . "/")) evil-surround-pairs-alist)
  (push '(40 . ("(" . ")")) evil-surround-pairs-alist)
  (push '(41 . ("(" . ")")) evil-surround-pairs-alist)
  (push '(91 . ("[" . "]")) evil-surround-pairs-alist)
  (push '(93 . ("[" . "]")) evil-surround-pairs-alist))
(add-hook 'prog-mode-hook 'evil-surround-prog-mode-hook-setup)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(defun evil-surround-js-mode-hook-setup ()
  "ES6." ;  <-- this is a documentation string, a feature in Lisp
  ;; I believe this is for auto closing pairs
  (push '(?1 . ("{`" . "`}")) evil-surround-pairs-alist)
  (push '(?2 . ("${" . "}")) evil-surround-pairs-alist)
  (push '(?4 . ("(e) => " . "(e)")) evil-surround-pairs-alist)
  ;; ReactJS
  (push '(?3 . ("classNames(" . ")")) evil-surround-pairs-alist))
(add-hook 'js2-mode-hook 'evil-surround-js-mode-hook-setup)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(defun evil-surround-emacs-lisp-mode-hook-setup ()
  (push '(?` . ("`" . "'")) evil-surround-pairs-alist))
(add-hook 'emacs-lisp-mode-hook 'evil-surround-emacs-lisp-mode-hook-setup)
(defun evil-surround-org-mode-hook-setup ()
  (push '(91 . ("[" . "]")) evil-surround-pairs-alist)
  (push '(93 . ("[" . "]")) evil-surround-pairs-alist)
  (push '(?= . ("=" . "=")) evil-surround-pairs-alist))
(add-hook 'org-mode-hook 'evil-surround-org-mode-hook-setup)
#+END_SRC




** Neotree

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'neotree)
#+END_SRC


*** set NeoTree default window width
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(setq neo-window-width 30)
#+END_SRC

*** toggle neotree with F8
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(global-set-key [f8] 'neotree-toggle)
#+END_SRC


*** make nerdtree open on emacs startup
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(add-hook 'after-init-hook #'neotree-toggle)
#+END_SRC


*** neotree 'icons' theme, which supports filetype icons
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(unless (display-graphic-p)
  (setq neo-theme 'icons))
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
#+END_SRC


*** make neotree window open and go the file currently opened
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(setq neo-smart-open t)
#+END_SRC


*** solve keybinding conflicts between neotree with evil mode
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (add-hook 'neotree-mode-hook
            (lambda ()
              ; default Neotree bindings
              (define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
              (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
              (define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
              (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
              (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
              (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
              (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
              (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)
              (define-key evil-normal-state-local-map (kbd "|") 'neotree-enter-vertical-split)
              (define-key evil-normal-state-local-map (kbd "-") 'neotree-enter-horizontal-split)
              ; simulating NERDTree bindings in Neotree
              (define-key evil-normal-state-local-map (kbd "R") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "u") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "C") 'neotree-change-root)
              (define-key evil-normal-state-local-map (kbd "c") 'neotree-create-node)))
#+END_SRC



** Vim plugins definitions

***  To enable evil-commentary permanently, add
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el

(evil-commentary-mode)
#+END_SRC

*** Vim Commentary
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'evil-commentary)
(evil-commentary-mode)
#+END_SRC

*** Evil-Matchit
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'evil-matchit)
(global-evil-matchit-mode 1)
#+END_SRC




* ORG mode

  The ORG part of the config compiles to a separate file, inside the config folder, called `org.el`
 
** Require ORG
   
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'org)
#+END_SRC

** Resolve issue with Tab not working with ORG only in Normal VI Mode in terminal
   
(something with TAB on terminals being related to C-i...)

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  (add-hook 'org-mode-hook                                                                      
            (lambda ()                                                                          
          (define-key evil-normal-state-map (kbd "TAB") 'org-cycle))) 

  ;; (setq evil-want-C-i-jump nil)
#+END_SRC
 



** Function to activate export-on-save in org mode

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(defun toggle-org-html-export-on-save ()
  "Make Emacs auto-export to HTML when org file is saved.
Enable calling this function from the file with <M-x>."
  (interactive)
  (if (memq 'org-html-export-to-html after-save-hook)
      (progn
        (remove-hook 'after-save-hook 'org-html-export-to-html t)
        (message "Disabled org html export on save for current buffer..."))
    (add-hook 'after-save-hook 'org-html-export-to-html nil t)
    (message "Enabled org html export on save for current buffer...")))
#+END_SRC


** Add hook to auto-export automatically on saveing ORG files

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  (defun org-mode-export-hook ()
    "This exports to diffenent outputs everytime the file is saved.
  This will be added to org-mode-hook, so it only activates on ORG files.
  Generates outputs in these formats:
  - PDF
  - HTML
  - RevealJS."
     (add-hook 'after-save-hook 'org-beamer-export-to-pdf t t)
     (add-hook 'after-save-hook 'org-reveal-export-to-html t t))

  ; Finally adds the above hook in org-mode-hook.
  ;; (add-hook 'org-mode-hook #'org-mode-export-hook)
#+END_SRC


** Evil-ORG


 #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
 (after 'org
   (require 'evil-org)
   (require 'evil-org-agenda)
   (add-hook 'org-mode-hook #'evil-org-mode)
   (add-hook 'evil-org-mode-hook
             (lambda ()
               (evil-org-set-key-theme))))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
 ;; (add-hook 'org-mode-hook 'evil-org-mode)
 ;; (evil-org-set-key-theme '(navigation insert textobjects additional calendar))
 ;; (evil-org-agenda-set-keys)
 #+END_SRC


 
*** Simulate <leader> key with Spacebar

 #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
     (defvar my-leader-map (make-sparse-keymap)
       "Keymap for \"leader key\" shortcuts.")

     ;; binding "SPC" to the keymap
    (define-key evil-normal-state-map (kbd "M-SPC") my-leader-map)

     ;; binding using SPC leader
     (define-key my-leader-map "b" 'list-buffers)
     (define-key my-leader-map "w" 'evil-save)
     (define-key my-leader-map "SPC" ":noh")
 #+END_SRC

 # #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
 #   (/bindings/define-keys evil-normal-state-map
 #     ("C-w h" #'evil-window-left)
 #     ("C-w j" #'evil-window-down)
 #     ("C-w k" #'evil-window-up)
 #     ("C-w l" #'evil-window-right))
 # #+END_SRC

 
 
** ox-pandoc

As pandoc supports many number of formats, initial org-export-dispatch
shortcut menu does not show full of its supported formats. You can customize
org-pandoc-menu-entry variable (and probably restart Emacs) to change its
default menu entries.
If you want delayed loading of `ox-pandoc’ when org-pandoc-menu-entry
is customized, please consider the following settings in your init file"

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(with-eval-after-load 'ox
  (require 'ox-pandoc))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'ox-pandoc)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  ;; default options for all output formats
  (setq org-pandoc-options '((standalone . t)))
  ;; cancel above settings only for 'docx' format
  (setq org-pandoc-options-for-docx '((standalone . nil)))
  ;; special settings for beamer-pdf and latex-pdf exporters
  (setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
  (setq org-pandoc-options-for-latex-pdf '((pdf-engine . "luatex")))
  ;; special extensions for markdown_github output
  (setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
#+END_SRC


