emacs.d/emacs.org
** ReveaJS org-reveal:
: This delay makes the options to export to RevealJS appear on the exporter menu (C-c C-e)

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(with-eval-after-load 'ox
  (require 'ox-reveal))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'ox-reveal)
#+END_SRC



* Eshell

** Make eshell open in a split-window buffer at the bottom of the screen
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun /eshell/new-window ()
    "Opens up a new shell in the directory associated with the current buffer's file.  The eshell is renamed to match that directory to make multiple eshell windows easier."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 3))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (rename-buffer (concat "*eshell: " name "*"))

      (insert (concat "ls"))
      (eshell-send-input)))

; Pull eshell in a new bottom window
(define-key evil-normal-state-map (kbd "!") #'/eshell/new-window)
(define-key evil-visual-state-map (kbd "!") #'/eshell/new-window)
(define-key evil-motion-state-map (kbd "!") #'/eshell/new-window)
#+END_SRC


* Helm

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'helm)

(setq helm-bookmark-show-location t)
(setq helm-buffer-max-length 40)
(setq helm-split-window-inside-p t)
(setq helm-mode-fuzzy-match t)
(setq helm-ff-file-name-history-use-recentf t)
(setq helm-ff-skip-boring-files t)
(setq helm-follow-mode-persistent t)

(after 'helm-source
  (defun /helm/make-source (f &rest args)
    (let ((source-type (cadr args))
          (props (cddr args)))
      (unless (child-of-class-p source-type 'helm-source-async)
        (plist-put props :fuzzy-match t))
      (apply f args)))
  (advice-add 'helm-make-source :around '/helm/make-source))
#+END_SRC


** Other helm settings

#+BEGIN_SRC emacs-lisp :tangle init.el
(after 'helm
  ;; take between 10-30% of screen space
  (setq helm-autoresize-min-height 10)
  (setq helm-autoresize-max-height 30)
  (helm-autoresize-mode t))
#+END_SRC

Make helm replace the default Find-File and M-x

#+BEGIN_SRC emacs-lisp :tangle init.el
   (progn
   (global-set-key [remap execute-extended-command] #'helm-M-x)
   (global-set-key [remap find-file] #'helm-find-files)
   (helm-mode t))
#+END_SRC

** Helm related bindings
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(after 'helm
  (require 'helm-config)
  (global-set-key (kbd "C-c h") #'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))
  (global-set-key (kbd "C-h a") #'helm-apropos)
  (global-set-key (kbd "C-x b") #'helm-buffers-list)
  (global-set-key (kbd "C-x C-b") #'helm-mini)
  (global-set-key (kbd "C-x C-f") #'helm-find-files)
  (global-set-key (kbd "C-x r b") #'helm-bookmarks)
  (global-set-key (kbd "M-x") #'helm-M-x)
  (global-set-key (kbd "M-y") #'helm-show-kill-ring)
  (global-set-key (kbd "M-:") #'helm-eval-expression-with-eldoc)
  (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z") #'helm-select-action)
)
#+END_SRC


* Dired

#+BEGIN_SRC emacs-lisp :tangle init.el
  (after 'dired
    (require 'dired-k)
    (setq dired-k-style 'git)
    (setq dired-k-human-readable t)
    (add-hook 'dired-initial-position-hook #'dired-k))
#+END_SRC


* Magit

** Load evil-magit with magit buffer

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(after 'magit
  (require 'evil-magit)
  (evil-magit-init))
#+END_SRC


** define global keybing to magit-status
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC
   

* which-key

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'which-key)
  (setq which-key-idle-delay 0.2)
  (setq which-key-min-display-lines 3)
  (setq which-key-max-description-length 20)
  (setq which-key-max-display-columns 6)
  (which-key-mode)
#+END_SRC


* General editor configuration
  
  
** Show line numbers
#+BEGIN_SRC emacs-lisp :tangle init.el
  (when (version<= "26.0.50" emacs-version )
    (global-display-line-numbers-mode))
#+END_SRC



** Line Number : Pretty format
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq linum-format " %d ")
#+END_SRC



** Use the system clipboard
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq x-select-enable-clipboard t)
#+END_SRC




** Window navigation with vim-like bindings

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; for some readon the bellow lines should be the default native way for navigation on emacs
  ;; but they dont work
  ;; using the above package instead til i find a solution
  ;
  ;; (windmove-default-keybindings 'control)
  ;; (global-set-key (kbd "C-h") 'windmove-left)
  ;; (global-set-key (kbd "C-l") 'windmove-right)
  ;; (global-set-key (kbd "C-k") 'windmove-up)
  ;; (global-set-key (kbd "C-j") 'windmove-down)
#+END_SRC


Bellow i use the `define-keys` function to map window navigation to default Vim bindings <C-hjkl>

First require the file with the function

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (require 'evil-tmux-navigator)
#+END_SRC


Then create the keybindings 
#+BEGIN_SRC emacs-lisp :tangle init.el
  (define-prefix-command 'evil-window-map)
  (define-key evil-window-map "h" 'evil-window-left)
  (define-key evil-window-map "j" 'evil-window-down)
  (define-key evil-window-map "k" 'evil-window-up)
  (define-key evil-window-map "l" 'evil-window-right)
  (define-key evil-window-map "b" 'evil-window-bottom-right)
  (define-key evil-window-map "c" 'evil-window-delete)
  (define-key evil-motion-state-map "\M-w" 'evil-window-map)
#+END_SRC

    
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (/bindings/define-keys evil-normal-state-map
  ;;   ("C-w h" #'evil-window-left)
  ;;   ("C-w j" #'evil-window-down)
  ;;   ("C-w k" #'evil-window-up)
  ;;   ("C-w l" #'evil-window-right))
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (/bindings/define-keys evil-normal-state-map
  ;;   ("C-w h" #'evil-window-left)
  ;;   ("C-w j" #'evil-window-down)
  ;;   ("C-w k" #'evil-window-up)
  ;;   ("C-w l" #'evil-window-right))
#+END_SRC


** Increase, decrease and adjust font size

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C-_") #'text-scale-decrease)
  ;; (global-set-key (kbd "C-)") #'text-scale-adjust)
#+END_SRC


* General text editing settings

** Turn on auto-revert mode (auto updates files changed on disk)
#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-auto-revert-mode 1)
  (setq auto-revert-interval 0.5)
#+END_SRC

  
** Spellchecking
#+BEGIN_SRC emacs-lisp :tangle init.el
(defconst *spell-check-support-enabled* t) ;; Enable with t if you prefer
#+END_SRC

I recommend adding this to your .emacs, as it makes C-n insert newlines if the point is at the end of the buffer. Useful, as it means you won’t have to reach for the return key to add newlines!
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq next-line-add-newlines t)
#+END_SRC


** Smartscan mode
: Usage:
: M-n and M-p move between symbols
: M-' to replace all symbols in the buffer matching the one under point
: C-u M-' to replace symbols in your current defun only (as used by narrow-to-defun.)

#+BEGIN_SRC emacs-lisp :tangle init.el
  (smartscan-mode 1)
#+END_SRC


** PDF Tools

*** Install pdf-tools if its not already installed
#+BEGIN_SRC emacs-lisp :tangle init.el
   (pdf-tools-install)
#+END_SRC


*** Make buffer refresh every 1 second to PDF-tools updates the changed pdf
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  ;; (add-hook 'pdf-view-mode-hook 'auto-revert-mode) 
  ;; (add-hook 'doc-view-mode-hook 'auto-revert-mode) 
#+END_SRC


*** PDF tools evil keybindings
#+BEGIN_SRC emacs-lisp :tangle init.el
  (evil-define-key 'normal pdf-view-mode-map
    "h" 'pdf-view-previous-page-command
    "j" (lambda () (interactive) (pdf-view-next-line-or-next-page 5))
    "k" (lambda () (interactive) (pdf-view-previous-line-or-previous-page 5))
    "l" 'pdf-view-next-page-command)
#+END_SRC



* Development environment customizations
  
  
  
** show mathing parenthesis
#+BEGIN_SRC emacs-lisp :tangle init.el
; parentheses
(show-paren-mode t)
#+END_SRC



** indentation
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default indent-tabs-mode nil)
  (setq-default c-basic-offset 2)
#+END_SRC



** enable rainbow-mode on relevant filetypes

Colorize hex, rgb and named color codes
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'org-mode-hook 'rainbow-mode)
  (add-hook 'css-mode-hook 'rainbow-mode)
  (add-hook 'php-mode-hook 'rainbow-mode)
  (add-hook 'html-mode-hook 'rainbow-mode)
  (add-hook 'web-mode-hook 'rainbow-mode)
  (add-hook 'js2-mode-hook 'rainbow-mode)
#+END_SRC



* Appearance

  
