emacs.d/emacs.org
** Applying my theme
   
#+BEGIN_SRC emacs-lisp :tangle init.el

  (add-to-list 'custom-theme-load-path "~/dotfiles/emacs.d/themes/")
  ; theme options:
  ; atom-one-dark (doenst work well with emacsclient, ugly blue bg)
  ; dracula
  ; darktooth
  ; gruvbox-dark-hard
  ; gruvbox-dark-light
  ; gruvbox-dark-medium
  ; base16-default-dark <-- this one is good

  (setq my-theme 'dracula)
  
#+END_SRC

Load the theme

#+BEGIN_SRC emacs-lisp :tangle init.el
 (load-theme my-theme t)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle init.el

  ;; (defun load-my-theme (frame)
  ;;   "Function to load the theme in current FRAME.
  ;;   sed in conjunction
  ;;   with bellow snippet to load theme after the frame is loaded
  ;;   to avoid terminal breaking theme."
  ;;   (select-frame frame)
  ;;   (load-theme my-theme t))

  ;; ; make emacs load the theme after loading the frame
  ;; ; resolves issue with the theme not loading properly in terminal mode on emacsclient

  ;; ;; this if was breaking my emacs!!!!!
  ;;  (add-hook 'after-make-frame-functions #'load-my-theme)
#+END_SRC



** Customizing the mode line

#+BEGIN_SRC emacs-lisp :tangle init.el
 (require 'smart-mode-line)
 (if (require 'smart-mode-line nil 'noerror)
     (progn
       ;( sml/name-width 20)
       ;( sml/mode-width 'full)
       ;( sml/shorten-directory t)
       ;( sml/shorten-modes t)
       (require 'smart-mode-line-powerline-theme)
       ; this must be BEFORE (sml/setup)
       (sml/apply-theme 'powerline)
       ;; Alternatives:
       ;; (sml/apply-theme 'powerline)
       ;; (sml/apply-theme 'dark)
       ;; (sml/apply-theme 'light)
       ;; (sml/apply-theme 'respectful)
       ;; (sml/apply-theme 'automatic)


       (if after-init-time
           (sml/setup)
         (add-hook 'after-init-hook 'sml/setup))


       (display-time-mode 1)
      
       (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/" ":DB:"))
       (add-to-list 'sml/replacer-regexp-list
                    '("^~/.*/lib/ruby/gems" ":GEMS" ))
       (add-to-list 'sml/replacer-regexp-list
                    '("^~/Projects/" ":CODE:"))))
#+END_SRC

 
* PrettierJS

   
Require first so i can actually use it

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'prettier-js)
#+END_SRC
  
** add prettier to js2 and rjsx minor modes

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'js2-mode-hook 'prettier-js-mode)
  (add-hook 'web-mode-hook 'prettier-js-mode)
  (add-hook 'rjsx-mode-hook 'prettier-js-mode)
#+END_SRC

** Add prettier to Web-Mode
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun enable-minor-mode (my-pair)
  "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
  (if (buffer-file-name)
      (if (string-match (car my-pair) buffer-file-name)
      (funcall (cdr my-pair)))))
#+END_SRC

And then hook to web-mode like this:

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'web-mode-hook #'(lambda ()
                            (enable-minor-mode
                             '("\\.js?\\'" . prettier-js-mode)
                             '("\\.jsx?\\'" . prettier-js-mode)
                             '("\\.css?\\'" . prettier-js-mode))))
#+END_SRC


* Minor modes

  
** js2-refactor

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'js2-mode-hook #'js2-refactor-mode)
#+END_SRC


*** choose js2-refactor keybinding scheme (this can be changed easily)

#+BEGIN_SRC emacs-lisp :tangle init.el
  (js2r-add-keybindings-with-prefix "C-c C-m")
#+END_SRC


** web-mode

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'web-mode)
#+END_SRC


* File associations

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
#+END_SRC


** template engines filetypes

#+BEGIN_SRC emacs-lisp :tangle init.el
 (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
 (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
#+END_SRC

** use rjsx mode for js files in React folder structure
   
better support for JSX and React and GatsbyJs

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-to-list 'auto-mode-alist '("components\\/.*\\.js\\'" . rjsx-mode))
(add-to-list 'auto-mode-alist '("pages\\/.*\\.js\\'" . rjsx-mode))
#+END_SRC


* FlyCheck linter

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'after-init-hook #'global-flycheck-mode)
#+END_SRC


* Autocompletion and Snippets
  
** enable autocompletion engine

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'auto-complete)
(global-auto-complete-mode t)
#+END_SRC


** Company mode (Complete Anything)
   
   
*** Basic settings for company-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'company)
  (global-company-mode t)
  (setq company-tooltip-limit 20)                      ; bigger popup window
  (setq company-minimum-prefix-length 1)               ; start completing after 1st char typed
  (setq company-idle-delay .1)                         ; decrease delay before autocompletion popup shows
  (setq company-echo-delay 0)                          ; remove annoying blinking
  (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
  (setq company-dabbrev-downcase nil)                  ; Do not convert to lowercase
  (setq company-dabbrev-ignore-case t)
  (setq company-dabbrev-code-everywhere t)
  (setq company-selection-wrap-around t)               ; continue from top when reaching bottom
  (setq company-auto-complete 'company-explicit-action-p)
#+END_SRC


*** Enable company-mode in all buffers
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-init-hook 'global-company-mode)
#+END_SRC
(add

*** Bind <TAB> to company-indent-or-complete
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-init-hook 'global-company-mode)

  ; (after "company-autoloads"
  ;    (define-key evil-insert-state-map (kbd "TAB")
  ;      #'company-indent-or-complete-common))
#+END_SRC


** Yasnippets

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (add-to-list 'load-path
  ;;               "~/.emacs.d/plugins/yasnippet")
  (require 'yasnippet)
  (yas-global-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq yas-snippet-dirs
      '("~/.emacs.d/snippets"                 ;; personal snippets
        ))
#+END_SRC


* Languages specific settings

** HTML
   
*** Emmet
    
    
Add hook to any markup file to load emmet-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
  (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation. 
#+END_SRC

Use emmet with JSX markup

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq emmet-expand-jsx-className? t) ;; default nil
#+END_SRC

** Ruby mode
#+BEGIN_SRC emacs-lisp :tangle init.el
;(require 'ruby.tau)
;(add-to-list 'auto-mode-alist '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))
#+END_SRC


** PHP mode
#+BEGIN_SRC emacs-lisp :tangle init.el
(autoload 'php-mode "php-mode" "Major mode for editing PHP code." t)
(add-to-list 'auto-mode-alist '("\\.php$" . php-mode))
(add-to-list 'auto-mode-alist '("\\.inc$" . php-mode))
#+END_SRC


** Go mode
#+BEGIN_SRC emacs-lisp :tangle init.el
; (autoload 'go-mode "go-mode" "Major mode for editing Go code." t)
; (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))
#+END_SRC


** markdown-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
; (autoload 'mardown-mode "markdown-mode")
; (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC


** haskell-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
; ; (require 'haskell-interactive-mode)
; (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
; (eval-after-load 'flycheck
;                  '(add-hook 'flycheck-mode-hook #'flycheck-haskell-setup))
; (add-hook 'haskell-mode-hook (lambda ()
;                                (electric-indent-mode -1)))
; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
; (add-hook 'haskell-mode-hook (lambda () (global-set-key (kbd "<f5>") 'haskell-process-cabal-build)))
#+END_SRC




* LaTeX

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'ox-latex)
#+END_SRC

** AucTex settings

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'tex)
#+END_SRC

Three steps are required (as according to ORG official docs) to setup AucTex with Emacs:

*** 1) Tell emacs where the LaTeX related bins are located in the system

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq exec-path (append exec-path '("/usr/bin/tex")))
#+END_SRC

*** 2) Load AucTex
    
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (load "auctex.el" nil t t)
  ;; (load "preview-latex.el" nil t t)
#+END_SRC

