emacs.d/emacs.org
*** 3) Add Latex to list of org-babel loaded languages
    
#+END_SRC
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (org-babel-do-load-languages
  'org-babel-load-languages
  '((latex . t)))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle init.el
     (setq TeX-auto-save t)
     (setq TeX-parse-self t)
     (setq-default TeX-master nil)
 #+END_SRC


 #+BEGIN_SRC emacs-lisp :tangle init.el
     (add-hook 'LaTeX-mode-hook 'visual-line-mode)
     (add-hook 'LaTeX-mode-hook 'flyspell-mode)
     (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)   
 #+END_SRC




** Latex Classes
*** Add the beamer presentation class template to org
 #+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'org-latex-classes
	       '("beamer"
	         "\\documentclass\[presentation\]\{beamer\}"
	         ("\\section\{%s\}" . "\\section*\{%s\}")
	         ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
	         ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
 #+END_SRC


*** Add the memoir class template to org
    
The Sections and Heading Levels gets configured as follows: 

    | Division       | <c>Level | <c>org-equivalent |
    | \book          |       -2 | *                 |
    | \part          |       -1 | **                |
    | \chapter       |        0 | ***               |
    | \section       |        1 | ****              |
    | \subsection    |        2 | *****             |
    | \subsubsection |        3 | ******            |
    | \paragraph     |        4 | *******           |
    | \subparagraph  |        5 | ********          |

    
#+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'org-latex-classes
                '("memoir"
                  "\\documentclass\[a4paper\]\{memoir\}"
                  ("\\book\{%s\}" . "\\book*\{%s\}")
                  ("\\part\{%s\}" . "\\part*\{%s\}")
                  ("\\chapter\{%s\}" . "\\chapter*\{%s\}")
                  ("\\section\{%s\}" . "\\section*\{%s\}")
                  ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
                  ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
#+END_SRC

*** Add abntex2 class to org list of latex classes
This class is based on the Memoir class
The Sections and Heading Levels gets configured as follows: 

    | Division       | <c>Level | <c>org-equivalent |
    | \part          |       -1 | *                 |
    | \chapter       |        0 | **                |
    | \section       |        1 | ***               |
    | \subsection    |        2 | ****              |
    | \subsubsection |        3 | *****             |
    | \paragraph     |        4 | ******            |
    | \subparagraph  |        5 | *******           |
#+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'org-latex-classes
             '("abntex2"
               "\\documentclass{abntex2}"
               ("\\part{%s}" . "\\part*{%s}")
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\subsubsubsection{%s}" . "\\subsubsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}"))
             ) 
#+END_SRC

 
** Enable latex-preview-pane
#+BEGIN_SRC emacs-lisp :tangle init.el
   (latex-preview-pane-enable)
#+END_SRC

** To compile documents to PDF by default add the following to your ~/.emacs.

#+BEGIN_SRC emacs-lisp :tangle init.el
     (setq TeX-PDF-mode t)
#+END_SRC

*** If it doesn’t work, try this :

#+BEGIN_SRC emacs-lisp :tangle init.el
     (TeX-global-PDF-mode t)
#+END_SRC


** To highlight (or font-lock) the “\section{title}” lines:

#+BEGIN_SRC emacs-lisp :tangle init.el
(font-lock-add-keywords
   'latex-mode
   `((,(concat "^\\s-*\\\\\\("
               "\\(documentclass\\|\\(sub\\)?section[*]?\\)"
               "\\(\\[[^]% \t\n]*\\]\\)?{[-[:alnum:]_ ]+"
               "\\|"
               "\\(begin\\|end\\){document"
               "\\)}.*\n?")
      (0 'your-face append))))
#+END_SRC


** Convert quotes to LaTeX Smartquotes
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq org-export-with-smart-quotes t)
#+END_SRC

** Keep latex logfiles
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq org-latex-remove-logfiles nil)
#+END_SRC

* Helper functions

  
** Copy/Paste To/From System's Clipboard =D
    
   
*** Copy
    
#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun copy-to-clipboard ()
    "Make F8 and F9 Copy and Paste to/from OS Clipboard.  Super usefull."
    (interactive)
    (if (display-graphic-p)
	(progn
	  (message "Yanked region to x-clipboard!")
	  (call-interactively 'clipboard-kill-ring-save)
	  )
      (if (region-active-p)
	  (progn
	    (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
	    (message "Yanked region to clipboard!")
	    (deactivate-mark))
	(message "No region active; can't yank to clipboard!")))
    )
#+END_SRC


*** Paste
    
#+BEGIN_SRC emacs-lisp :tangle init.el
  (evil-define-command paste-from-clipboard()
    (if (display-graphic-p)
	(progn
	  (clipboard-yank)
	  (message "graphics active")
	  )
      (insert (shell-command-to-string "xsel -o -b")) ) )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key [f9] 'copy-to-clipboard)
  (global-set-key [f10] 'paste-from-clipboard)
#+END_SRC


** Auto save function

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun my-save ()
    "Save file when leaving insert mode in Evil."
    (if (buffer-file-name)
	(evil-save)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'evil-insert-state-exit-hook 'my-save)
#+END_SRC



#+BEGIN_SRC emacs-lisp :tangle init.el
;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:


(provide 'init)
;;; .emacs ends here

#+END_SRC





* Provide packages in separate files

** Provide the evil.tau.el file
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(provide 'evil.tau)
;;; evil.tau.el ends here...
#+END_SRC

** Provide the org.tau.el file

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(provide 'org.tau)
;;; org.tau.el ends here...
#+END_SRC
